# TBB_UpdateOldBorders

## Description
Updates Drawing Border - Universal and VAA Title Block objects to Title Block Border objects.

```pascal
PROCEDURE TBB_UpdateOldBorders(VAR NumUpdated : INTEGER);
```

```python

def vs.TBB_UpdateOldBorders():
    return NumUpdated
```

## Parameters
|Name|Type|Description|
|---|---|---|
|NumUpdated|INTEGER||

## Version
Availability: from Vectorworks 2018
## Category
* Utility